podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/I2S0_MK82F25615.svd.xml
            <register>
               <name>RCR4</name>
               <description>SAI Receive Configuration 4 Register</description>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>FSD</name>
                     <description>Frame Sync Direction\n
Configures the direction of the frame sync</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Generated externally\t(slave mode)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Generated internally\t(master mode)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSP</name>
                     <description>Frame Sync Polarity\n
Configures the polarity of the frame sync</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Active high</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Active low</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ONDEM</name>
                     <description>On Demand Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Internal frame sync is generated continuously</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Internal frame sync is generated when the FIFO warning flag is clear</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSE</name>
                     <description>Frame Sync Early\n
Control where frame sync asserts relative to 1st bit of the frame</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Asserts with first bit</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Asserts one bit before first bit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MF</name>
                     <description>MSB First\n
Configures whether the LSB or the MSB is transmitted/received first</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>LSB first</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MSB first</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYWD</name>
                     <description>Sync Width\n
Configures the length of the frame sync in number of bit clocks.\n
The value written must be one less than the number of bit clocks.\n
 or example, write 0 for the frame sync to assert for one bit clock only</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>FRSZ</name>
                     <description>Frame size\n
Configures the number of words in each frame.\n
The value written must be one less than the number of words in the frame.\n
For example, write 0 for one word per frame</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>FPACK</name>
                     <description>FIFO Packing Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FIFO packing is disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>8-bit FIFO packing is enabled</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>16-bit FIFO packing is enabled</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FCOMB</name>
                     <description>FIFO Combine Mode</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FIFO combine mode disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>FIFO combine mode enabled on FIFO writes (from receive shift registers)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>FIFO combine mode enabled on FIFO reads (by software)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>FIFO combine mode enabled on FIFO writes (from receive shift registers) and reads (by software)</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FCONT</name>
                     <description>FIFO Continue on Error</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>On FIFO error, the SAI will continue from the start of the next frame after the FIFO error flag has been cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>On FIFO error, the SAI will continue from the same word that caused the FIFO error to set after the FIFO warning flag has been cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCR5</name>
               <description>SAI Receive Configuration 5 Register</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>FBT</name>
                     <description>First Bit Shifted\n
Configures the bit index for the first bit transmitted for each word in the frame.\n
If configured for MSB First, the index of the next bit transmitted is one less than the current bit transmitted.\n
If configured for LSB First, the index of the next bit transmitted is one more than the current bit transmitted</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>W0W</name>
                     <description>Word 0 Width\n
Configures the number of bits in the first word in each frame.\n
The value written must be one less than the number of bits in the first word.\n
Word width of less than 8 bits is not supported if there is only one word per frame</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>WNW</name>
                     <description>Word N Width\n
Configures the number of bits in each word, for each word except the first in the frame.\n
The value written must be one less than the number of bits per word.\n
The value of WNW must be greater than or equal to the value of W0W even when there is only one word in each frame.\n
Word width of less than 8 bits is not supported</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>RDR%s</name>
               <description>SAI Receive Data Register</description>
               <addressOffset>0xA0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDR</name>
                     <description>Receive Data Register\n
Reads from this register when the receive FIFO is not empty will return the data from the top of the receive FIFO.\n
Reads from this register when the receive FIFO is empty are ignored</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>RFR%s</name>
               <description>SAI Receive FIFO Register</description>
               <addressOffset>0xC0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RFP</name>
                     <description>Read FIFO Pointer\n
FIFO read pointer for receive data channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RCP</name>
                     <description>Receive Channel Pointer</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No effect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FIFO combine is enabled for FIFO reads and this FIFO will be read on the next FIFO read</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WFP</name>
                     <description>Write FIFO Pointer\n
FIFO write pointer for receive data channel</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMR</name>
               <description>SAI Receive Mask Register</description>
               <addressOffset>0xE0</addressOffset>
               <fields>
                  <field>
                     <name>RWM</name>
                     <description>Receive Word Mask\n
Configures whether the receive word is masked (received data ignored and\n
 not written to receive FIFO) for the corresponding word in the frame</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Word N is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Word N is masked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCR</name>
               <description>SAI MCLK Control Register</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>MICS</name>
                     <description>MCLK Input Clock Select\nSelects the clock input to the MCLK divider</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Input clock 0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Input clock 1</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Input clock 2</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Input clock 3</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MOE</name>
                     <description>MCLK Output Enable\n
Enables the MCLK divider and configures the MCLK signal pin as an output.\n
 When software clears this field, it remains set until the MCLK divider is fully disabled</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pin is input bypassing the MCLK Divider</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Pin is output from the MCLK Divider</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DUF</name>
                     <description>Divider Update Flag\n
Provides the status of on-the-fly updates to the MCLK divider ratio\n
Updates to the MCLK divider ratio are blocked while this flag remains set</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Ratio not updating</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Ratio is updating on-the-fly</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDR</name>
               <description>SAI MCLK Divide Register\n
Sets the MCLK divide ratio such that: MCLK output = MCLK input * ( (FRACT + 1) / (DIVIDE + 1) ).\n
FRACT must be set equal or less than the value in the DIVIDE field</description>
               <addressOffset>0x104</addressOffset>
               <fields>
                  <field>
                     <name>DIVIDE</name>
                     <description>MCLK Divide\nSets the MCLK divide value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>FRACT</name>
                     <description>MCLK Fraction\nSets the MCLK fraction value</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
